<%@ Page Language="C#" AutoEventWireup="true" CodeBehind="ContractDocument.aspx.cs" Inherits="BestBoQ.ContractDocument" %>

<!DOCTYPE html>

<html xmlns="http://www.w3.org/1999/xhtml">
<head runat="server">
    <title></title>
</head>
<body>
    <form id="form1" runat="server">
        <div>
            <p>วันที่ <%=ProjectStart %></p>
            <p>สัญญาฉบับนี้ ทำขึ้นที่ <%=CompanyName %> ตั้งอยู่<%=CompanyAddress %> ระหว่าง <%=CompanyName %>โดย <%=CustomerName %> ถือบัตรประจำตัวประชาชนเลขที่ <%=CustomerNationalID %>  ผู้มีอำนาจลงนาม สำนักงานตั้งอยู่<%=CompanyAddress %> ซึ่งในสัญญานี้จะเรียกว่า “ผู้รับจ้าง” ฝ่ายหนึ่ง กับ <%=CustomerName %> <%=CustomerAddress %> ซึ่งต่อไปนี้ในสัญญาเรียกว่า “ผู้ว่าจ้าง” อีกฝ่ายหนึ่ง คู่สัญญาทั้งสองฝ่ายได้ตกลงทำสัญญากันมีข้อกำหนดและเงื่อนไขดังต่อไปนี้</p>
            <p>ข้อ 1. ผู้ว่าจ้างตกลงว่าจ้างและผู้รับจ้างตกลงรับจ้างตกแต่ง...<%=HomeName %>...พื้นที่ใช้สอยรวม...<%=Area %>...ตารางเมตร จำนวน.....1 หลัง........บนโฉนดที่ดินเลขที่ - เลขที่ดิน...- หน้าสำรวจ - ตั้งอยู่ที่...<%=CustomerProvince %>...(มีสำเนาโฉนดที่ดินเป็นเอกสารแนบ)</p>
            <p>ข้อ 2. ผู้ว่าจ้าง ขอรับรองว่าเป็นเจ้าของโฉนดที่ดินแปลงดังกล่าวจริง และที่ดินแปลงดังกล่าวไม่มีหนี้สินหรือ ภาระติดพันใดๆ</p>

            <p>ข้อ 3. ผู้รับจ้าง ตกลงเป็นผู้จัดหาแรงงานรวมทั้งวัสดุและอุปกรณ์ที่ใช้ในการก่อสร้าง ไม่ว่าสำหรับงานก่อสร้างตามสัญญาหรืองานที่ขอเพิ่มเติม โดยจะดำเนินการตามมาตรฐานให้สอดคล้องกับแผนงานการก่อสร้าง</p>
            <p>ข้อ 4. ผู้ว่าจ้าง ตกลงชำระค่าจ้างให้แก่ผู้รับจ้าง โดยตกลงค่าจ้างกันในราคารวมเป็น <%=TotalPrice %> บาท (<%=TotalPriceTxt %>) โดยปรากฏรายระเอียดการก่อสร้างตามเอกสารภาคผนวก ก.  เอกสารต่างๆ ดังต่อไปนี้ให้ถือเป็นส่วนหนึ่งของสัญญาฉบับนี้ด้วย ดังนี้ </p>
            <table>
                <tr>
                    <td>4.1 ภาคผนวก ก.: การชำระเงินค่าก่อสร้าง
		                    4.2 ภาคผนวก ข.: แปลนบ้าน
		                    4.3 ภาคผนวก ค.: รายการวัสดุมาตรฐาน
		                    4.4 ภาคผนวก ง.: เอกสารแนบท้ายสัญญา 
                            4.5 สำเนาบัตรประจำตัวประชาชน/สำเนาทะเบียนบ้านของผู้ว่าจ้าง
                            4.6 สำเนาบัตรประจำตัวประชาชน/สำเนาทะเบียนบ้านของผู้รับจ้าง
                            4.7 สำเนาโฉนดที่ดินแปลงที่จะปลูกสร้างบ้านของผู้ว่าจ้าง (ถ้ามี)
                    </td>
                </tr>
            </table>

            <p>ข้อ 5. ผู้ว่าจ้างตกลงชำระค่าจ้างให้แก่ผู้รับจ้าง โดยแบ่งชำระเป็นงวดๆ ตามเอกสารภาคผนวก ก. โดยผู้ว่าจ้างหรือตัวแทนผู้ว่าจ้างจะตรวจรับมอบงานและชำระให้แก่ผู้รับจ้างภายในเจ็ด (7) วัน นับแต่วันที่ผู้รับจ้างได้ดำเนินการตามงวดงานนั้นแล้วเสร็จ</p>
            <p>ในกรณีที่ ผู้ว่าจ้างไม่ชำระค่างวดตามเอกสารภาคผนวก ก. ภายในระยะเวลาที่กำหนด หรือภายในเจ็ด (7) วัน  โดยไม่มีการแจ้งสาเหตุกับทางผู้รับจ้าง  ผู้รับจ้างสามารถที่จะหยุดการทำงานต่อได้ โดยผู้รับจ้างสามารถดำเนินการทางกฎหมายกับทางผู้ว่าจ้างในการบังคับใช้สิทธิดังกล่าวได้</p>
            <p>ข้อ 6. หากผู้ว่าจ้างตกลงที่จะเป็นผู้จัดหาวัสดุและอุปกรณ์ที่ใช้ในการก่อสร้าง ไม่ว่าสำหรับงานก่อสร้างตามสัญญาหรืองานที่ขอเพิ่มเติม ผู้ว่าจ้างจะต้องดำเนินการจัดหาและส่งมอบวัสดุอุปกรณ์ดังกล่าวที่ใช้ในการก่อสร้างตามระยะเวลาในการก่อสร้างให้แก่ผู้รับจ้างภายในเวลาที่ผู้รับจ้างกำหนด เพื่อผู้รับจ้างสามารถทำงานก่อสร้างให้แล้วเสร็จตามที่กำหนดไว้ในสัญญา มิฉะนั้น ผู้รับจ้างขอสงวนสิทธิ์ที่จะใช้วัสดุและอุปกรณ์ที่ใช้ในการก่อสร้างตามที่ได้ระบุไว้ในสัญญานี้</p>
            <p>ข้อ 7. ผู้รับจ้าง จะต้องเริ่มทำการก่อสร้างบ้านภายในสามสิบ (30) วัน นับจากวันที่เซ็นสัญญา หรือตามเงื่อนไข ข้อตกลงกันระหว่าง ผู้ว่าจ้างกับ ผู้รับจ้างอีกที  ทั้งนี้จะต้องไม่เกินกำหนดระยะเวลา <%=Month %> เดือน นับจากวันเซ็นต์สัญญา</p>
            <p>ข้อ 8. ผู้รับจ้างตกลงส่งมอบเอกสารต่างๆ ให้แก่ผู้ว่าจ้าง หลังจากวันที่ชำระค่าก่อสร้างงวดสุดท้าย (เอกสารบางอย่างบริการให้เฉพาะในเขตตัวเมืองสกลนครเท่านั้น)  โดยมีรายการ ดังนี้</p>
            <table>
                <tr>
                    <td>8.1 ใบอนุญาตก่อสร้างบ้าน (ถ้ามี)
                            8.2 เล่มทะเบียนบ้าน (ถ้ามี)
                            8.3 หนังสือรับประกันงาน
                            8.4 หนังสือรับประกันการติดตั้งเครื่องใช้ไฟฟ้าภายในบ้านทั้งหมด (ถ้ามี) จากร้านค้าเท่านั้น 
                            8.5 แบบบ้าน
                            8.6 เอกสารการเปลี่ยนแปลงต่างๆในแบบบ้าน (ถ้ามี)
                            8.7 แบบแปลนโครงสร้าง
                            8.8 แบบแปลนระบบไฟฟ้าและระบบสุขาภิบาล
                            8.9 กุญแจบ้านทั้งหมด
                    </td>
                </tr>
            </table>

            <p>ข้อ 9. ผู้รับจ้างมีหน้าที่ทำการก่อสร้างบ้านพักอาศัย ตามแบบแปลนและรายการประกอบแบบแปลนที่ตกลงกันในภาคผนวก ข. หรือตามที่ได้รับอนุญาตจากเจ้าพนักงาน โดยต้องทำการก่อสร้างให้ถูกต้องตามเทคนิควิธีและมาตรฐานการก่อสร้าง และผู้รับจ้างต้องทำการให้แล้วเสร็จภายใน <%=Month %> เดือนนับจากวันเริ่มลงงาน</p>

            <ul>
                <li>8	 เดือน	สำหรับบ้านราคาไม่เกิน		3	ล้านบาท</li>
                <li>10	 เดือน	สำหรับบ้านราคาไม่เกิน		5	ล้านบาท</li>
                <li>11	 เดือน	สำหรับบ้านราคาไม่เกิน		8	ล้านบาท</li>
                <li>12	 เดือน	สำหรับบ้านราคาไม่เกิน		10	ล้านบาท</li>
                <li>14	 เดือน	สำหรับบ้านราคาไม่เกิน		15	ล้านบาท</li>
                <li>18	 เดือน	สำหรับบ้านราคามากกว่า	15	ล้านบาท</li>
            </ul>

            <p>ข้อ 10. หากผู้รับจ้างไม่อาจดำเนินการก่อสร้างบ้านพักอาศัยให้แล้วเสร็จภายในระยะเวลาตามข้อ 9 โดยเหตุที่มิใช่ความผิดของผู้รับจ้าง ผู้รับจ้างมีสิทธิที่จะขอขยายระยะเวลาการก่อสร้างออกไปตามที่เห็นสมควร หรือ ถ้ามีการเปลี่ยนแปลงและเพิ่มเติมไปจากเดิม</p>

            <p>ข้อ 11. หากผู้ว่าจ้างประสงค์ที่จะทำการแก้ไขเปลี่ยนแปลงบ้านพักอาศัยให้แตกต่างไปจากแบบแปลนบ้านที่ได้ตกลงทำสัญญากันไว้ ผู้ว่าจ้างต้องแจ้งให้ผู้รับจ้างทราบโดยเร็วเพื่อผู้รับจ้างจะได้ทำการแก้ไขเปลี่ยนแปลงให้เป็นไปตามความประสงค์ของผู้ว่าจ้างและขยายเวลาการก่อสร้างให้ผู้รับจ้างตามเห็นสมควรด้วย  หากมีการก่อสร้างบ้านไปตามสัญญาแล้วและไม่อาจที่จะแก้ไขเปลี่ยนแปลงตามความประสงค์ของผู้ว่าจ้างได้ ผู้รับจ้างขอสงวนสิทธิ์ที่จะดำเนินการก่อสร้างบ้านตามแบบแปลนในสัญญาเดิมจนแล้วเสร็จ โดยถือว่า ผู้ว่าจ้างไม่ประสงค์ที่จะเปลี่ยนแปลงแก้ไขแบบแปลนบ้านตามสัญญา</p>

            <p>ข้อ 11.1 หากผู้ว่าจ้างประสงค์ที่จะให้ทำการก่อสร้างเพิ่มเติมจากแบบแปลนบ้านตามสัญญา ผู้ว่าจ้างต้องแจ้งให้ผู้รับจ้างทราบโดยเร็วและต้องมีการทำบันทึกข้อตกลงเพิ่มเติมงานก่อสร้างกันก่อนพร้อมผู้ว่าจ้างต้อง ชำระเงินในส่วนงานก่อสร้างที่เพิ่มเติมขึ้นจากสัญญาให้แก่ผู้รับจ้างก่อนลงมือทำการก่อสร้าง มิฉะนั้น ผู้รับจ้างขอสงวนสิทธิ์ที่จะดำเนินงานก่อสร้างบ้านตามแบบแปลนบ้านในสัญญาโดยถือว่า ผู้ว่าจ้างไม่ประสงค์ที่จะให้มีการก่อสร้างเพิ่มเติมบ้านให้ผิดไปจากแบบแปลนเดิม</p>
            <p>ข้อ 11.2 หากผู้ว่าจ้างประสงค์ที่จะให้มีการลดรายการก่อสร้างบ้านตามสัญญา ผู้ว่าจ้างต้องแจ้งให้ผู้รับจ้างทราบโดยเร็วและต้องมีการทำบันทึกข้อตกลงลดรายการก่อสร้างกันก่อน สำหรับมูลค่างานลดต้องไม่เกิน 20 % ของราคาค่าก่อสร้างตามสัญญา และรายการก่อสร้างนั้นให้นำไปหักลดในงวดงานสุดท้ายตามสัญญา</p>

            <p>ข้อ 12. ผู้ว่าจ้างมีสิทธิในการเข้าไปในพื้นที่ก่อสร้างบ้านในเวลาใดๆก็ได้ โดยผู้ว่าจ้างจะไม่ทำการรบกวนการทำงานของผู้รับจ้าง</p>

            <p>ข้อ 13. ในกรณีที่ผู้รับจ้างทำงานไม่เสร็จภายในวันเวลาที่กำหนด ผู้ว่าจ้างสามารถบอกเลิกจ้างได้ (เว้นแต่ในเนื้องานไม่มีการเพิ่มเติมจากแบบแปลนเดิม)</p>

            <p>ข้อ 14. ผู้รับจ้างจะต้องรับผิดชอบต่ออุปัทวะเหตุ หรือภยันตราย ความเสียหายใดๆ ที่เกิดขึ้นจากการงานของผู้รับจ้างเอง และต้องรับผิดชอบในเหตุที่เสียหายอันเกิดแก่ทรัพย์สิน  ของผู้ว่าจ้างซึ่งมีอยู่ในบริเวณที่ทำการจ้างนี้โดยการกระทำ ของคนงานช่างหรือบริวารของผู้รับจ้างด้วย</p>

            <p>ข้อ 15. หากผู้รับจ้างผิดสัญญาข้อใดข้อหนึ่ง ผู้รับจ้างจำเป็นต้องแจ้งกับผู้ว่าจ้างทราบด้วยวาจา หรือ เป็นลายลักษณ์อักษร โดยกำหนดระยะเวลาดำเนินการในการแก้ปฏิบัติให้ถูกต้องตามสมควรเสียก่อน</p>

            <p>ข้อ 16. หากผู้ว่าจ้างผิดสัญญาข้อใดข้อหนึ่ง หรือ ผู้ว่าจ้างไม่ชำระค่าก่อสร้างงวดใดงวดหนึ่ง ผู้ว่าจ้างจำเป็นต้องแจ้งกับผู้รับจ้างทราบด้วยวาจา หรือ เป็นลายลักษณ์อักษร โดยกำหนดระยะเวลาดำเนินการในการแก้ปฏิบัติให้ถูกต้องตามสมควรเสียก่อน</p>

            <p>ข้อ 17. การรับประกันงาน</p>
            <table>
                <tr>
                    <td>17.1 รับประกันคุณภาพงานทั่วไป เป็นระยะเวลา 2 ปี นับจากวันที่ส่งมอบบ้าน  
                            17.2 รับประกันคุณภาพงานโครงสร้างหลังคา เป็นระยะเวลา 5 ปี นับจากวันที่ส่งมอบบ้าน    
                            17.3 รับประกันคุณภาพงานโครงสร้างบ้าน เป็นระยะเวลา 15 ปี นับจากวันที่ส่งมอบบ้าน    
                            17.4 ผู้รับจ้าง จะไม่รับประกันคุณภาพงาน สาเหตุอันเนื่องมาจาก ภาวะสงคราม อุบัติภัย อุทกภัย หรือภัยธรรมชาติต่างๆ เช่น อัคคีภัย, วาตภัย, แผ่นดินไหว เป็นต้น
                    </td>
                </tr>
            </table>

            <p>สัญญานี้ทำขึ้นเป็นสองฉบับมีข้อความถูกต้องตรงกัน คู่สัญญาทั้งสองฝ่ายได้อ่านและเข้าใจข้อความในสัญญาโดยตลอดแล้วเห็นว่าถูกต้อง จึงได้ลงลายมือชื่อพร้อมประทับตรา (ถ้ามี) ไว้เป็นสำคัญต่อหน้าพยาน และต่างฝ่ายต่างยึดถือไว้ฝ่ายละหนึ่งฉบับ</p>

            <table>
                <tr>
                    <td>ลงชื่อ ...................................... ผู้ว่าจ้าง</td>
                    <td>ลงชื่อ ...................................... ผู้รับจ้าง</td>
                </tr>
                <tr>
                    <td><%=CustomerName %></td>
                    <td><%=CompanySign %></td>
                </tr>
                <tr>
                    <td></td>
                    <td><%=CompanyName %></td>
                </tr>
                <tr>
                    <td>ลงชื่อ ......................................พยาน</td>
                    <td>ลงชื่อ ......................................พยาน</td>
                </tr>
                <tr>
                    <td>(                                         )</td>
                    <td>(                                         )</td>
                </tr>
            </table>
            <p>***ในกรณีที่ผู้ว่าจ้างดำเนินงานล่าช้าและเสร็จไม่ตรงตามกำหนดทางผู้รับจ้างยินยอมจ่ายชดเชยให้ผู้ว่าจ้างรายวันเป็นวันละ 0.05 %ของมูลค่างานที่เหลือ แต่ไม่น้อยกว่าวันละ 1,000 บาท</p>
        </div>
    </form>
</body>
</html>

